## Overview of a DataFrame

In [1]:
import pandas as pd
import numpy as np

### Creating DataFrame from Dictionary

In [2]:
city_data = {
    "City": ["New York City", "Paris", "Barcelona", "Rome"],
    "Country": ["United States", "France", "Spain", "Italy"],
    "Population": pd.Series([8600000, 2141000, 5515000, 2873000])
}

cities = pd.DataFrame(city_data)
cities

            City        Country  Population
0  New York City  United States     8600000
1          Paris         France     2141000
2      Barcelona          Spain     5515000
3           Rome          Italy     2873000

In [3]:
# The two lines below are equivalent
cities.transpose()
cities.T

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

### Creating a DataFrame from a NumPy ndarray

In [4]:
random_data = np.random.randint(1, 101, [3, 5])
random_data

array([[57, 84, 77, 42, 98],
       [89, 85, 96, 52, 88],
       [66, 47, 56, 86, 41]])

In [5]:
pd.DataFrame(data=random_data)

    0   1   2   3   4
0  57  84  77  42  98
1  89  85  96  52  88
2  66  47  56  86  41

In [6]:
row_labels = ["Morning", "Afternoon", "Evening"]
temperatures = pd.DataFrame(
    data=random_data, index=row_labels
)
temperatures

            0   1   2   3   4
Morning    57  84  77  42  98
Afternoon  89  85  96  52  88
Evening    66  47  56  86  41

In [7]:
row_labels = ["Morning", "Afternoon", "Evening"]
column_labels = (
    "Monday",
    "Tuesday",
    "Wednesday",
    "Thursday",
    "Friday"
)

pd.DataFrame(
    data=random_data,
    index=row_labels,
    columns=column_labels,
)

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning        57       84         77        42      98
Afternoon      89       85         96        52      88
Evening        66       47         56        86      41

In [8]:
row_labels = ["Morning", "Afternoon", "Morning"]
column_lables = [
    "Monday",
    "Tuesday",
    "Wednesday",
    "Tuesday",
    "Friday"
]

pd.DataFrame(
    data=random_data,
    index=row_labels,
    columns=column_labels,
)

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning        57       84         77        42      98
Afternoon      89       85         96        52      88
Morning        66       47         56        86      41

## Similarities between Series and DataFrames

### Importing a DataFrame with the read_csv Function

In [9]:
pd.read_csv("data/nba.csv")

               Name                 Team Position  Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG   9/26/96   1445697
1    Christian Wood      Detroit Pistons       PF   9/27/95   1645357
2     PJ Washington    Charlotte Hornets       PF   8/23/98   3831840
3      Derrick Rose      Detroit Pistons       PG   10/4/88   7317074
4     Marial Shayok   Philadelphia 76ers        G   7/26/95     79568
..              ...                  ...      ...       ...       ...
445   Austin Rivers      Houston Rockets       PG    8/1/92   2174310
446     Harry Giles     Sacramento Kings       PF   4/22/98   2578800
447     Robin Lopez      Milwaukee Bucks        C    4/1/88   4767000
448   Collin Sexton  Cleveland Cavaliers       PG    1/4/99   4764960
449     Ricky Rubio         Phoenix Suns       PG  10/21/90  16200000

[450 rows x 5 columns]

In [10]:
nba = pd.read_csv("data/nba.csv")
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 450 entries, 0 to 449
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      450 non-null    object
 1   Team      450 non-null    object
 2   Position  450 non-null    object
 3   Birthday  450 non-null    object
 4   Salary    450 non-null    int64
dtypes: int64(1), object(4)
memory usage: 17.7+ KB

### Shared and Exclusive Attributes between Series and DataFrames

In [11]:
pd.Series([1, 2, 3]).dtype

dtype('int64')

In [12]:
nba.dtypes

Name        object
Team        object
Position    object
Birthday    object
Salary       int64
dtype: object

In [13]:
nba.dtypes.value_counts()

object    4
int64     1
Name: count, dtype: int64

In [14]:
nba.index

RangeIndex(start=0, stop=450, step=1)

In [15]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [16]:
nba.ndim

2

In [17]:
nba.shape

(450, 5)

In [18]:
nba.size

2250

In [19]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [20]:
nba.count().sum()

2250

In [21]:
data = {
    "A": [1, np.nan],
    "B": [2, 3]
}

df = pd.DataFrame(data)
df

     A  B
0  1.0  2
1  NaN  3

In [22]:
df.size

4

In [23]:
df.count()

A    1
B    2
dtype: int64

In [24]:
df.count().sum()

3

### Shared Methods between Series and DataFrames

In [25]:
nba.head(2)

             Name                Team Position Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG  9/26/96  1445697
1  Christian Wood     Detroit Pistons       PF  9/27/95  1645357

In [26]:
nba.tail(n=3)

              Name                 Team Position  Birthday    Salary
447    Robin Lopez      Milwaukee Bucks        C    4/1/88   4767000
448  Collin Sexton  Cleveland Cavaliers       PG    1/4/99   4764960
449    Ricky Rubio         Phoenix Suns       PG  10/21/90  16200000

In [27]:
nba.tail()

              Name                 Team Position  Birthday    Salary
445  Austin Rivers      Houston Rockets       PG    8/1/92   2174310
446    Harry Giles     Sacramento Kings       PF   4/22/98   2578800
447    Robin Lopez      Milwaukee Bucks        C    4/1/88   4767000
448  Collin Sexton  Cleveland Cavaliers       PG    1/4/99   4764960
449    Ricky Rubio         Phoenix Suns       PG  10/21/90  16200000

In [28]:
nba.sample(3)

               Name                Team Position Birthday  Salary
4     Marial Shayok  Philadelphia 76ers        G  7/26/95   79568
106       KZ Okpala          Miami Heat       SF  4/28/99  898310
207  Daniel Gafford       Chicago Bulls        C  10/1/98  898310

In [29]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [30]:
nba.max()

Name            Zylan Cheatham
Team        Washington Wizards
Position                    SG
Birthday                9/9/93
Salary                40231758
dtype: object

In [31]:
nba.min()

Name         Aaron Gordon
Team        Atlanta Hawks
Position                C
Birthday          1/10/98
Salary              79568
dtype: object

In [32]:
nba.nlargest(n=4, columns="Salary")

                  Name                   Team Position  Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG   3/14/88  40231758
38          Chris Paul  Oklahoma City Thunder       PG    5/6/85  38506482
219  Russell Westbrook        Houston Rockets       PG  11/12/88  38506482
251          John Wall     Washington Wizards       PG    9/6/90  38199000

In [33]:
nba.sum(numeric_only=True)

Salary    3444112694
dtype: int64

In [34]:
nba.mean(numeric_only=True)

Salary    7.653584e+06
dtype: float64

In [35]:
nba.median(numeric_only=True)

Salary    3303074.5
dtype: float64

In [36]:
nba.mode(numeric_only=True)

   Salary
0   79568

In [37]:
nba.std(numeric_only=True)

Salary    9.288810e+06
dtype: float64

## 4.3 Sorting a DataFrame

### Sorting by Single Column

In [38]:
# The two lines below are equivalent
nba.sort_values("Name")
nba.sort_values(by="Name")

                  Name                   Team Position  Birthday    Salary
52        Aaron Gordon          Orlando Magic       PF   9/16/95  19863636
101      Aaron Holiday         Indiana Pacers       PG   9/30/96   2239200
437        Abdel Nader  Oklahoma City Thunder       SF   9/25/93   1618520
81         Adam Mokoka          Chicago Bulls        G   7/18/98     79568
399  Admiral Schofield     Washington Wizards       SF   3/30/97   1000000
..                 ...                    ...      ...       ...       ...
159        Zach LaVine          Chicago Bulls       PG   3/10/95  19500000
302       Zach Norvell     Los Angeles Lakers       SG   12/9/97     79568
312       Zhaire Smith     Philadelphia 76ers       SG    6/4/99   3058800
137    Zion Williamson   New Orleans Pelicans        F    7/6/00   9757440
248     Zylan Cheatham   New Orleans Pelicans       SF  11/17/95     79568

[450 rows x 5 columns]

In [39]:
nba.sort_values("Name", ascending=False).head()

                Name                  Team Position  Birthday    Salary
248   Zylan Cheatham  New Orleans Pelicans       SF  11/17/95     79568
137  Zion Williamson  New Orleans Pelicans        F    7/6/00   9757440
312     Zhaire Smith    Philadelphia 76ers       SG    6/4/99   3058800
302     Zach Norvell    Los Angeles Lakers       SG   12/9/97     79568
159      Zach LaVine         Chicago Bulls       PG   3/10/95  19500000

In [40]:
nba.sort_values("Birthday", ascending=False).head()

                    Name                  Team Position Birthday    Salary
383            Josh Gray  New Orleans Pelicans       PG   9/9/93     79568
310  Matthew Dellavedova   Cleveland Cavaliers       PG   9/8/90   9607500
376     Donovan Mitchell             Utah Jazz       SG   9/7/96   3635760
71            Kevin Love   Cleveland Cavaliers        C   9/7/88  28942830
89            Joe Harris         Brooklyn Nets       SF   9/6/91   7666667

### 4.3.2 Sorting by Multiple Columns

In [41]:
nba.sort_values(by=["Team", "Name"])

                Name                Team Position  Birthday    Salary
359         Alex Len       Atlanta Hawks        C   6/16/93   4160000
167     Allen Crabbe       Atlanta Hawks       SG    4/9/92  18500000
276  Brandon Goodwin       Atlanta Hawks       PG   10/2/95     79568
438   Bruno Fernando       Atlanta Hawks        C   8/15/98   1400000
194      Cam Reddish       Atlanta Hawks       SF    9/1/99   4245720
..               ...                 ...      ...       ...       ...
418     Jordan McRae  Washington Wizards       PG   3/28/91   1645357
273  Justin Robinson  Washington Wizards       PG  10/12/97    898310
428    Moritz Wagner  Washington Wizards        C   4/26/97   2063520
21     Rui Hachimura  Washington Wizards       PF    2/8/98   4469160
36     Thomas Bryant  Washington Wizards        C   7/31/97   8000000

[450 rows x 5 columns]

In [42]:
nba.sort_values(["Team", "Name"], ascending=False)

                Name                Team Position  Birthday    Salary
36     Thomas Bryant  Washington Wizards        C   7/31/97   8000000
21     Rui Hachimura  Washington Wizards       PF    2/8/98   4469160
428    Moritz Wagner  Washington Wizards        C   4/26/97   2063520
273  Justin Robinson  Washington Wizards       PG  10/12/97    898310
418     Jordan McRae  Washington Wizards       PG   3/28/91   1645357
..               ...                 ...      ...       ...       ...
194      Cam Reddish       Atlanta Hawks       SF    9/1/99   4245720
438   Bruno Fernando       Atlanta Hawks        C   8/15/98   1400000
276  Brandon Goodwin       Atlanta Hawks       PG   10/2/95     79568
167     Allen Crabbe       Atlanta Hawks       SG    4/9/92  18500000
359         Alex Len       Atlanta Hawks        C   6/16/93   4160000

[450 rows x 5 columns]

In [43]:
nba.sort_values(
    by=["Team", "Salary"], ascending=[True, False]
)

                  Name                Team Position  Birthday    Salary
111   Chandler Parsons       Atlanta Hawks       SF  10/25/88  25102512
28         Evan Turner       Atlanta Hawks       PG  10/27/88  18606556
167       Allen Crabbe       Atlanta Hawks       SG    4/9/92  18500000
213    De'Andre Hunter       Atlanta Hawks       SF   12/2/97   7068360
339      Jabari Parker       Atlanta Hawks       PF   3/15/95   6500000
..                 ...                 ...      ...       ...       ...
80         Isaac Bonga  Washington Wizards       PG   11/8/99   1416852
399  Admiral Schofield  Washington Wizards       SF   3/30/97   1000000
273    Justin Robinson  Washington Wizards       PG  10/12/97    898310
283   Garrison Mathews  Washington Wizards       SG  10/24/96     79568
353      Chris Chiozza  Washington Wizards       PG  11/21/95     79568

[450 rows x 5 columns]

In [44]:
nba = nba.sort_values(
    by=["Team", "Salary"],
    ascending=[True, False]
)

## Sorting by Index

In [45]:
nba.head()

                 Name           Team Position  Birthday    Salary
111  Chandler Parsons  Atlanta Hawks       SF  10/25/88  25102512
28        Evan Turner  Atlanta Hawks       PG  10/27/88  18606556
167      Allen Crabbe  Atlanta Hawks       SG    4/9/92  18500000
213   De'Andre Hunter  Atlanta Hawks       SF   12/2/97   7068360
339     Jabari Parker  Atlanta Hawks       PF   3/15/95   6500000

### Sorting by Row Index

In [46]:
# The two lines below are equivalent
nba.sort_index().head()
nba.sort_index(ascending=True).head()

             Name                Team Position Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG  9/26/96  1445697
1  Christian Wood     Detroit Pistons       PF  9/27/95  1645357
2   PJ Washington   Charlotte Hornets       PF  8/23/98  3831840
3    Derrick Rose     Detroit Pistons       PG  10/4/88  7317074
4   Marial Shayok  Philadelphia 76ers        G  7/26/95    79568

In [47]:
nba.sort_index(ascending=False).head()

              Name                 Team Position  Birthday    Salary
449    Ricky Rubio         Phoenix Suns       PG  10/21/90  16200000
448  Collin Sexton  Cleveland Cavaliers       PG    1/4/99   4764960
447    Robin Lopez      Milwaukee Bucks        C    4/1/88   4767000
446    Harry Giles     Sacramento Kings       PF   4/22/98   2578800
445  Austin Rivers      Houston Rockets       PG    8/1/92   2174310

In [48]:
nba = nba.sort_index()

### Sorting by Column Index

In [49]:
# The two lines below are equivalent
nba.sort_index(axis="columns").head()
nba.sort_index(axis=1).head()

  Birthday            Name Position   Salary                Team
0  9/26/96    Shake Milton       SG  1445697  Philadelphia 76ers
1  9/27/95  Christian Wood       PF  1645357     Detroit Pistons
2  8/23/98   PJ Washington       PF  3831840   Charlotte Hornets
3  10/4/88    Derrick Rose       PG  7317074     Detroit Pistons
4  7/26/95   Marial Shayok        G    79568  Philadelphia 76ers

In [50]:
nba.sort_index(axis="columns", ascending=False).head()

                 Team   Salary Position            Name Birthday
0  Philadelphia 76ers  1445697       SG    Shake Milton  9/26/96
1     Detroit Pistons  1645357       PF  Christian Wood  9/27/95
2   Charlotte Hornets  3831840       PF   PJ Washington  8/23/98
3     Detroit Pistons  7317074       PG    Derrick Rose  10/4/88
4  Philadelphia 76ers    79568        G   Marial Shayok  7/26/95

## Setting a New Index

In [51]:
# The two lines below are equivalent
nba.set_index(keys="Name")
nba.set_index("Name")

                               Team Position  Birthday    Salary
Name
Shake Milton     Philadelphia 76ers       SG   9/26/96   1445697
Christian Wood      Detroit Pistons       PF   9/27/95   1645357
PJ Washington     Charlotte Hornets       PF   8/23/98   3831840
Derrick Rose        Detroit Pistons       PG   10/4/88   7317074
Marial Shayok    Philadelphia 76ers        G   7/26/95     79568
...                             ...      ...       ...       ...
Austin Rivers       Houston Rockets       PG    8/1/92   2174310
Harry Giles        Sacramento Kings       PF   4/22/98   2578800
Robin Lopez         Milwaukee Bucks        C    4/1/88   4767000
Collin Sexton   Cleveland Cavaliers       PG    1/4/99   4764960
Ricky Rubio            Phoenix Suns       PG  10/21/90  16200000

[450 rows x 4 columns]

In [52]:
nba = nba.set_index(keys="Name")

In [53]:
nba = pd.read_csv("data/nba.csv", index_col="Name")
nba["Birthday"] = pd.to_datetime(nba["Birthday"], format="mixed")

## Selecting Columns and Rows from a DataFrame

### Selecting a Single Column from a DataFrame

In [54]:
nba.Salary

Name
Shake Milton       1445697
Christian Wood     1645357
PJ Washington      3831840
Derrick Rose       7317074
Marial Shayok        79568
                    ...
Austin Rivers      2174310
Harry Giles        2578800
Robin Lopez        4767000
Collin Sexton      4764960
Ricky Rubio       16200000
Name: Salary, Length: 450, dtype: int64

In [55]:
nba["Position"]

Name
Shake Milton      SG
Christian Wood    PF
PJ Washington     PF
Derrick Rose      PG
Marial Shayok      G
                  ..
Austin Rivers     PG
Harry Giles       PF
Robin Lopez        C
Collin Sexton     PG
Ricky Rubio       PG
Name: Position, Length: 450, dtype: object

### Selecting Multiple Columns from a DataFrame

In [56]:
nba[["Salary", "Birthday"]].head()

                 Salary   Birthday
Name
Shake Milton    1445697 1996-09-26
Christian Wood  1645357 1995-09-27
PJ Washington   3831840 1998-08-23
Derrick Rose    7317074 1988-10-04
Marial Shayok     79568 1995-07-26

In [57]:
nba[["Birthday", "Salary"]].head()

                 Birthday   Salary
Name
Shake Milton   1996-09-26  1445697
Christian Wood 1995-09-27  1645357
PJ Washington  1998-08-23  3831840
Derrick Rose   1988-10-04  7317074
Marial Shayok  1995-07-26    79568

In [58]:
nba.select_dtypes(include="object")

                               Team Position
Name
Shake Milton     Philadelphia 76ers       SG
Christian Wood      Detroit Pistons       PF
PJ Washington     Charlotte Hornets       PF
Derrick Rose        Detroit Pistons       PG
Marial Shayok    Philadelphia 76ers        G
...                             ...      ...
Austin Rivers       Houston Rockets       PG
Harry Giles        Sacramento Kings       PF
Robin Lopez         Milwaukee Bucks        C
Collin Sexton   Cleveland Cavaliers       PG
Ricky Rubio            Phoenix Suns       PG

[450 rows x 2 columns]

In [59]:
nba.select_dtypes(exclude=["object", "int"])

                 Birthday
Name
Shake Milton   1996-09-26
Christian Wood 1995-09-27
PJ Washington  1998-08-23
Derrick Rose   1988-10-04
Marial Shayok  1995-07-26
...                   ...
Austin Rivers  1992-08-01
Harry Giles    1998-04-22
Robin Lopez    1988-04-01
Collin Sexton  1999-01-04
Ricky Rubio    1990-10-21

[450 rows x 1 columns]

## Selecting Rows from a DataFrame

### Extracting Rows by Index Label

In [60]:
nba.loc["LeBron James"]

Team         Los Angeles Lakers
Position                     PF
Birthday    1984-12-30 00:00:00
Salary                 37436858
Name: LeBron James, dtype: object

In [61]:
nba.loc[["Kawhi Leonard", "Paul George"]]

                               Team Position   Birthday    Salary
Name
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000
Paul George    Los Angeles Clippers       SF 1990-05-02  33005556

In [62]:
nba.loc[["Paul George", "Kawhi Leonard"]]

                               Team Position   Birthday    Salary
Name
Paul George    Los Angeles Clippers       SF 1990-05-02  33005556
Kawhi Leonard  Los Angeles Clippers       SF 1991-06-29  32742000

In [63]:
nba.sort_index().loc["Otto Porter":"Patrick Beverley"]

                                  Team Position   Birthday    Salary
Name
Otto Porter              Chicago Bulls       SF 1993-06-03  27250576
PJ Dozier               Denver Nuggets       PG 1996-10-25     79568
PJ Washington        Charlotte Hornets       PF 1998-08-23   3831840
Pascal Siakam          Toronto Raptors       PF 1994-04-02   2351838
Pat Connaughton        Milwaukee Bucks       SG 1993-01-06   1723050
Patrick Beverley  Los Angeles Clippers       PG 1988-07-12  12345680

In [64]:
players = ["Otto Porter", "PJ Dozier", "PJ Washington"]
players[0:2]

['Otto Porter', 'PJ Dozier']

In [65]:
nba.sort_index().loc["Zach Collins":]

                                   Team Position   Birthday    Salary
Name
Zach Collins     Portland Trail Blazers        C 1997-11-19   4240200
Zach LaVine               Chicago Bulls       PG 1995-03-10  19500000
Zach Norvell         Los Angeles Lakers       SG 1997-12-09     79568
Zhaire Smith         Philadelphia 76ers       SG 1999-06-04   3058800
Zion Williamson    New Orleans Pelicans        F 2000-07-06   9757440
Zylan Cheatham     New Orleans Pelicans       SF 1995-11-17     79568

In [66]:
nba.sort_index().loc[:"Al Horford"]

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
Al Horford            Philadelphia 76ers        C 1986-06-03  28000000

### Extracting Rows by Index Position

In [67]:
nba.iloc[300]

Team             Denver Nuggets
Position                     PF
Birthday    1999-04-03 00:00:00
Salary                  1416852
Name: Jarred Vanderbilt, dtype: object

In [68]:
nba.iloc[[100, 200, 300, 400]]

                                Team Position   Birthday   Salary
Name
Brian Bowen           Indiana Pacers       SG 1998-10-02    79568
Marco Belinelli    San Antonio Spurs       SF 1986-03-25  5846154
Jarred Vanderbilt     Denver Nuggets       PF 1999-04-03  1416852
Louis King           Detroit Pistons        F 1999-04-06    79568

In [69]:
nba.iloc[400:404]

                                    Team Position   Birthday    Salary
Name
Louis King               Detroit Pistons        F 1999-04-06     79568
Kostas Antetokounmpo  Los Angeles Lakers       PF 1997-11-20     79568
Rodions Kurucs             Brooklyn Nets       PF 1998-02-05   1699236
Spencer Dinwiddie          Brooklyn Nets       PG 1993-04-06  10605600

In [70]:
nba.iloc[:2]

                              Team Position   Birthday   Salary
Name
Shake Milton    Philadelphia 76ers       SG 1996-09-26  1445697
Christian Wood     Detroit Pistons       PF 1995-09-27  1645357

In [71]:
nba.iloc[447:]

                              Team Position   Birthday    Salary
Name
Robin Lopez        Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio           Phoenix Suns       PG 1990-10-21  16200000

In [72]:
nba.iloc[-10:-6]

                                    Team Position   Birthday   Salary
Name
Jared Dudley          Los Angeles Lakers       PF 1985-07-10  2564753
Max Strus                  Chicago Bulls       SG 1996-03-28    79568
Kevon Looney       Golden State Warriors        C 1996-02-06  4464286
Willy Hernangomez      Charlotte Hornets        C 1994-05-27  1557250

In [73]:
nba.iloc[0:10:2]

                             Team Position   Birthday    Salary
Name
Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
PJ Washington   Charlotte Hornets       PF 1998-08-23   3831840
Marial Shayok  Philadelphia 76ers        G 1995-07-26     79568
Kendrick Nunn          Miami Heat       SG 1995-08-03   1416852
Brook Lopez       Milwaukee Bucks        C 1988-04-01  12093024

### Extracting Values from Specific Columns

In [74]:
nba.loc["Giannis Antetokounmpo", "Team"]

'Milwaukee Bucks'

In [75]:
nba.loc["James Harden", ["Position", "Birthday"]]

Position                     PG
Birthday    1989-08-26 00:00:00
Name: James Harden, dtype: object

In [76]:
nba.loc[
    ["Russell Westbrook", "Anthony Davis"],
    ["Team", "Salary"]
]

                                 Team    Salary
Name
Russell Westbrook     Houston Rockets  38506482
Anthony Davis      Los Angeles Lakers  27093019

In [77]:
nba.loc["Joel Embiid", "Position":"Salary"]

Position                      C
Birthday    1994-03-16 00:00:00
Salary                 27504630
Name: Joel Embiid, dtype: object

In [78]:
nba.loc["Joel Embiid", "Salary":"Position"]

Series([], Name: Joel Embiid, dtype: object)

In [79]:
nba.iloc[57, 3]

796806

In [80]:
nba.iloc[100:104, :3]

                             Team Position   Birthday
Name
Brian Bowen        Indiana Pacers       SG 1998-10-02
Aaron Holiday      Indiana Pacers       PG 1996-09-30
Troy Daniels   Los Angeles Lakers       SG 1991-07-15
Buddy Hield      Sacramento Kings       SG 1992-12-17

In [81]:
nba.at["Austin Rivers", "Birthday"]

Timestamp('1992-08-01 00:00:00')

In [82]:
nba.iat[263, 1]

'PF'

In [83]:
%%timeit
nba.at["Austin Rivers", "Birthday"]

3.11 Âµs Â± 93.2 ns per loop (mean Â± std. dev. of 7 runs, 100,000 loops each)

In [84]:
%%timeit
nba.loc["Austin Rivers", "Birthday"]

4.64 Âµs Â± 13.6 ns per loop (mean Â± std. dev. of 7 runs, 100,000 loops each)

In [85]:
%%timeit
nba.iat[263, 1]

6.19 Âµs Â± 237 ns per loop (mean Â± std. dev. of 7 runs, 100,000 loops each)

In [86]:
%%timeit
nba.iloc[263, 1]

7.69 Âµs Â± 179 ns per loop (mean Â± std. dev. of 7 runs, 100,000 loops each)

## Extracting Values from Series

In [87]:
nba["Salary"].loc["Damian Lillard"]

29802321

In [88]:
nba["Salary"].at["Damian Lillard"]

29802321

In [89]:
nba["Salary"].iloc[234]

2033160

In [90]:
nba["Salary"].iat[234]

2033160

## Renaming Columns or Rows

In [91]:
nba.columns

Index(['Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [92]:
nba.columns = ["Team", "Position", "Date of Birth", "Pay"]
nba.head(1)

                            Team Position Date of Birth      Pay
Name
Shake Milton  Philadelphia 76ers       SG    1996-09-26  1445697

In [93]:
nba.rename(columns={"Date of Birth": "Birthday"})

                               Team Position   Birthday       Pay
Name
Shake Milton     Philadelphia 76ers       SG 1996-09-26   1445697
Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
PJ Washington     Charlotte Hornets       PF 1998-08-23   3831840
Derrick Rose        Detroit Pistons       PG 1988-10-04   7317074
Marial Shayok    Philadelphia 76ers        G 1995-07-26     79568
...                             ...      ...        ...       ...
Austin Rivers       Houston Rockets       PG 1992-08-01   2174310
Harry Giles        Sacramento Kings       PF 1998-04-22   2578800
Robin Lopez         Milwaukee Bucks        C 1988-04-01   4767000
Collin Sexton   Cleveland Cavaliers       PG 1999-01-04   4764960
Ricky Rubio            Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 4 columns]

In [94]:
nba = nba.rename(columns={"Date of Birth": "Birthday"})

In [95]:
nba.loc["Giannis Antetokounmpo"]

Team            Milwaukee Bucks
Position                     PF
Birthday    1994-12-06 00:00:00
Pay                    25842697
Name: Giannis Antetokounmpo, dtype: object

In [96]:
nba = nba.rename(
    index={"Giannis Antetokounmpo": "Greek Freak"}
)

In [97]:
nba.loc["Greek Freak"]

Team            Milwaukee Bucks
Position                     PF
Birthday    1994-12-06 00:00:00
Pay                    25842697
Name: Greek Freak, dtype: object

## Resetting an Index

In [98]:
nba.set_index("Team").head()

                   Position   Birthday      Pay
Team
Philadelphia 76ers       SG 1996-09-26  1445697
Detroit Pistons          PF 1995-09-27  1645357
Charlotte Hornets        PF 1998-08-23  3831840
Detroit Pistons          PG 1988-10-04  7317074
Philadelphia 76ers        G 1995-07-26    79568

In [99]:
nba.reset_index().head()

             Name                Team Position   Birthday      Pay
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G 1995-07-26    79568

In [100]:
nba.reset_index().set_index("Team").head()

                              Name Position   Birthday      Pay
Team
Philadelphia 76ers    Shake Milton       SG 1996-09-26  1445697
Detroit Pistons     Christian Wood       PF 1995-09-27  1645357
Charlotte Hornets    PJ Washington       PF 1998-08-23  3831840
Detroit Pistons       Derrick Rose       PG 1988-10-04  7317074
Philadelphia 76ers   Marial Shayok        G 1995-07-26    79568

In [101]:
nba = nba.reset_index().set_index("Team")

## Coding Challenge

In [102]:
nfl = pd.read_csv("data/nfl.csv", parse_dates=["Birthday"])
nfl

                    Name                  Team Position   Birthday   Salary
0           Tremon Smith   Philadelphia Eagles       RB 1996-07-20   570000
1         Shawn Williams    Cincinnati Bengals       SS 1991-05-13  3500000
2            Adam Butler  New England Patriots       DT 1994-04-12   645000
3            Derek Wolfe        Denver Broncos       DE 1990-02-24  8000000
4              Jake Ryan  Jacksonville Jaguars      OLB 1992-02-27  1000000
...                  ...                   ...      ...        ...      ...
1650    Bashaud Breeland    Kansas City Chiefs       CB 1992-01-30   805000
1651         Craig James   Philadelphia Eagles       CB 1996-04-29   570000
1652  Jonotthan Harrison         New York Jets        C 1991-08-25  1500000
1653         Chuma Edoga         New York Jets       OT 1997-05-25   495000
1654        Tajae Sharpe      Tennessee Titans       WR 1994-12-23  2025000

[1655 rows x 5 columns]

In [103]:
nfl = nfl.set_index("Name")
nfl

                                    Team Position   Birthday   Salary
Name
Tremon Smith         Philadelphia Eagles       RB 1996-07-20   570000
Shawn Williams        Cincinnati Bengals       SS 1991-05-13  3500000
Adam Butler         New England Patriots       DT 1994-04-12   645000
Derek Wolfe               Denver Broncos       DE 1990-02-24  8000000
Jake Ryan           Jacksonville Jaguars      OLB 1992-02-27  1000000
...                                  ...      ...        ...      ...
Bashaud Breeland      Kansas City Chiefs       CB 1992-01-30   805000
Craig James          Philadelphia Eagles       CB 1996-04-29   570000
Jonotthan Harrison         New York Jets        C 1991-08-25  1500000
Chuma Edoga                New York Jets       OT 1997-05-25   495000
Tajae Sharpe            Tennessee Titans       WR 1994-12-23  2025000

[1655 rows x 4 columns]

In [104]:
nfl = pd.read_csv("data/nfl.csv", index_col="Name", parse_dates=["Birthday"])

In [105]:
nfl.head()

                                Team Position   Birthday   Salary
Name
Tremon Smith     Philadelphia Eagles       RB 1996-07-20   570000
Shawn Williams    Cincinnati Bengals       SS 1991-05-13  3500000
Adam Butler     New England Patriots       DT 1994-04-12   645000
Derek Wolfe           Denver Broncos       DE 1990-02-24  8000000
Jake Ryan       Jacksonville Jaguars      OLB 1992-02-27  1000000

In [106]:
# The two lines below are equivalent
nfl.Team.value_counts().head()
nfl["Team"].value_counts().head()

Team
New York Jets          58
Kansas City Chiefs     56
Washington Redskins    56
New Orleans Saints     55
San Francisco 49Ers    55
Name: count, dtype: int64

In [107]:
nfl.sort_values("Salary", ascending=False).head()

                                 Team Position   Birthday    Salary
Name
Kirk Cousins        Minnesota Vikings       QB 1988-08-19  27500000
Jameis Winston   Tampa Bay Buccaneers       QB 1994-01-06  20922000
Marcus Mariota       Tennessee Titans       QB 1993-10-30  20922000
Derek Carr            Oakland Raiders       QB 1991-03-28  19900000
Jimmy Garoppolo   San Francisco 49Ers       QB 1991-11-02  17200000

In [108]:
nfl.sort_values(
    by=["Team", "Salary"],
    ascending=[True, False]
)

                                   Team Position   Birthday    Salary
Name
Chandler Jones        Arizona Cardinals      OLB 1990-02-27  16500000
Patrick Peterson      Arizona Cardinals       CB 1990-07-11  11000000
Larry Fitzgerald      Arizona Cardinals       WR 1983-08-31  11000000
David Johnson         Arizona Cardinals       RB 1991-12-16   5700000
Justin Pugh           Arizona Cardinals        G 1990-08-15   5000000
...                                 ...      ...        ...       ...
Ross Pierschbacher  Washington Redskins        C 1995-05-05    495000
Kelvin Harmon       Washington Redskins       WR 1996-12-15    495000
Wes Martin          Washington Redskins        G 1996-05-09    495000
Jimmy Moreland      Washington Redskins       CB 1995-08-26    495000
Jeremy Reaves       Washington Redskins       SS 1996-08-29    495000

[1655 rows x 4 columns]

In [109]:
nfl = nfl.reset_index().set_index(keys="Team")
nfl.head(3)

                                Name Position   Birthday   Salary
Team
Philadelphia Eagles     Tremon Smith       RB 1996-07-20   570000
Cincinnati Bengals    Shawn Williams       SS 1991-05-13  3500000
New England Patriots     Adam Butler       DT 1994-04-12   645000

In [110]:
nfl.loc["New York Jets"].head()

                           Name Position   Birthday   Salary
Team
New York Jets   Bronson Kaufusi       DE 1991-07-06   645000
New York Jets    Darryl Roberts       CB 1990-11-26  1000000
New York Jets     Jordan Willis       DE 1995-05-02   754750
New York Jets  Quinnen Williams       DE 1997-12-21   495000
New York Jets        Sam Ficken        K 1992-12-14   495000

In [111]:
nfl.loc["New York Jets"].sort_values("Birthday").head(1)

                     Name Position   Birthday   Salary
Team
New York Jets  Ryan Kalil        C 1985-03-29  2400000